benchmarks/http_suite_20260323_201959/wrk_ping_io1_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.60ms    1.66ms  42.81ms   70.19%
    Req/Sec     3.34k   514.56     6.82k    80.94%
  Latency Distribution
     50%    9.53ms
     75%   10.59ms
     90%   11.75ms
     99%   12.94ms
  134456 requests in 5.10s, 14.75MB read
Requests/sec:  26364.62
Transfer/sec:      2.89MB